In [2]:
import pandas as pd
import os

In [3]:
sales = pd.read_excel("Sales Data.xlsx")
sales.head()

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
1,Dennison Crosswaite,Canada,White Choc,2021-01-01,532,54
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
3,Barr Faughny,New Zealand,Baker's Choco Chips,2021-01-01,259,22
4,Beverie Moffet,USA,Manuka Honey Choco,2021-01-01,5530,179

In [4]:
sales.isna().sum()

Sales Person    0
Geography       0
Product         0
Date            0
Amount          0
Boxes           0
dtype: int64

In [5]:
sales.shape

(3791, 6)

In [ ]:
#Using loc
[0,2,4,6]
#extracts rows with the specified index numbers. Loc works with both integers and string
sales.loc[[0,2,4,6]]

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
4,Beverie Moffet,USA,Manuka Honey Choco,2021-01-01,5530,179
6,Oby Sorrel,UK,Raspberry Choco,2021-01-01,1057,71

In [ ]:
#Using iloc
#iloc works with only integers
sales.iloc[[0,2,4,6]]

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
4,Beverie Moffet,USA,Manuka Honey Choco,2021-01-01,5530,179
6,Oby Sorrel,UK,Raspberry Choco,2021-01-01,1057,71

In [8]:
sales.columns

Index(['Sales Person', 'Geography', 'Product', 'Date', 'Amount', 'Boxes'], dtype='object')

In [ ]:
#indexing columns
#this prints out the rows, columns based on the specified row indexes and column names
sales.loc[[0,2,4,7], ["Sales Person", "Product", "Amount"]]

       Sales Person              Product  Amount
0      Barr Faughny      Raspberry Choco    8414
2  Karlen McCaffrey      99% Dark & Pure    5376
4    Beverie Moffet   Manuka Honey Choco    5530
7    Dotty Strutley  Organic Choco Syrup    1036